app/Http/Controllers/QuestionsController.php

    public function index()
    {
        $questions = Question::with('user')->latest()->paginate(5);
---
select * from `questions` order by `created_at` desc limit 5 offset 0
select * from `users` where `users`.`id` in (1, 2)
select count(*) as aggregate from `questions`